spring-boot-restapi-consume-soapservice/soap-ws-jpa-crud/src/test/resources/requests/getEmployeeByIdRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://www.tech.vision.com/soap/employees">
   <soapenv:Header/>
   <soapenv:Body>
      <emp:getEmployeeByIdRequest>
	   <emp:employeeId>1</emp:employeeId>
	   </emp:getEmployeeByIdRequest>
   </soapenv:Body>
</soapenv:Envelope>